cases/transISODroplet2D/0.org/psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Placeholder: overwritten by leiaSetFields (signed distance to the sphere).
dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet   { type zeroGradient; }   // interior droplet stays far from boundaries
    outlet  { type zeroGradient; }
    walls   { type zeroGradient; }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
